public class Mili {
    public static void main(String[] args) {
        int ticket = 2000; //стоимость билета
        int mile = 20; //Рублей на одну бонусную милю
        int bonus = (ticket / mile); // Бонусные мили
        System.out.println(bonus + " Бонусных миль");

        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной милли
        // Рассчитываете количество бонусных милль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }

}
